src/main/resources/sp/sp1

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsse:UsernameToken wsu:Id="UsernameToken-fb8ff580-03bf-4d1c-8311-21024ce8cdab"><wsse:Username>soap</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">Nk2t21ZftYyoWNFgGCIs+LYwcOM=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">V6/RVNsfnh9XrwXLZnRX/Q==</wsse:Nonce><wsu:Created>2024-05-01T15:57:48.739Z</wsu:Created></wsse:UsernameToken><wsu:Timestamp wsu:Id="TS-4a2b9dfc-acd5-4a2e-948f-73b04da51b11"><wsu:Created>2024-05-01T15:57:48.728Z</wsu:Created><wsu:Expires>2024-05-01T16:02:48.728Z</wsu:Expires></wsu:Timestamp></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns3:GetAcsEmployees xmlns:ns10="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Workplace.VisitorsScoreboars" xmlns:ns11="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.AcsKeys" xmlns:ns12="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ISS" xmlns:ns13="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.FavoriteFolder" xmlns:ns14="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.Employees" xmlns:ns15="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity" xmlns:ns16="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.Schedule" xmlns:ns17="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.AdditionalFields" xmlns:ns18="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Log" xmlns:ns19="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS" xmlns:ns20="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Tag" xmlns:ns21="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.TimeTracking" xmlns:ns22="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.AccessLevels.AcsAccesPoints" xmlns:ns23="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.NUUO" xmlns:ns24="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.Vehicle" xmlns:ns25="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Reaction" xmlns:ns26="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ScreenLayout.CellContent.Camera" xmlns:ns27="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ContactInformation" xmlns:ns28="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.BoxAccessLevel" xmlns:ns29="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.AlcoGroup" xmlns:ns3="http://www.rusguardsecurity.ru" xmlns:ns30="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.Ivideon" xmlns:ns31="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.Net.Services.Entities" xmlns:ns32="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Mifare" xmlns:ns33="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.KeyKeeper" xmlns:ns34="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Workplace" xmlns:ns35="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Report.Incidents" xmlns:ns36="http://schemas.datacontract.org/2004/07/System.Net" xmlns:ns37="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver" xmlns:ns38="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Report" xmlns:ns39="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Branch" xmlns:ns4="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.UserPass" xmlns:ns40="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.CanDriversViaUsbConverter" xmlns:ns41="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ScreenLayout" xmlns:ns42="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.Trassir" xmlns:ns43="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ACS.AccessLevels" xmlns:ns44="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Folder" xmlns:ns45="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Workplace.MapsWorkplace" xmlns:ns46="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.IvidionCamera" xmlns:ns47="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.PostOffice" xmlns:ns48="http://schemas.datacontract.org/2004/07/System" xmlns:ns49="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.CardType" xmlns:ns5="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.IncidentDictionaries" xmlns:ns50="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.PhotoBank" xmlns:ns51="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ScreenLayout.CellContent.PhotoIdentification" xmlns:ns52="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Photo" xmlns:ns53="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Workplace.RemoteTerminal" xmlns:ns54="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.CommandNotification" xmlns:ns55="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.StorageState" xmlns:ns56="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.ScreenLayout.CellContent.PassInfo" xmlns:ns57="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Notifications" xmlns:ns58="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.Panasonic" xmlns:ns59="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.NTechLab" xmlns:ns6="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ns60="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Driver.BasIp" xmlns:ns61="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:ns62="http://schemas.datacontract.org/2004/07/System.Net.Sockets" xmlns:ns63="http://schemas.datacontract.org/2004/07/System.ComponentModel" xmlns:ns64="http://schemas.datacontract.org/2004/07/System.Runtime.InteropServices" xmlns:ns65="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Exceptions" xmlns:ns67="http://schemas.datacontract.org/2004/07/System.Data" xmlns:ns7="http://tempuri.org/" xmlns:ns8="http://schemas.datacontract.org/2004/07/RusGuard.Models" xmlns:ns9="http://schemas.datacontract.org/2004/07/VVIInvestment.RusGuard.DAL.Entities.Entity.Security" xmlns:xs="http://www.w3.org/2001/XMLSchema"/></SOAP-ENV:Body></SOAP-ENV:Envelope>